
### :robot: Terraform Report
---
##### Plan: `9` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firestore_database.overlays-ds will be created
  + resource "google_firestore_database" "overlays-ds" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "overlays-ds"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "maestro-intelligence"
      + type                              = "DATASTORE_MODE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_firestore_database.overlays-fs will be created
  + resource "google_firestore_database" "overlays-fs" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = "DELETE_PROTECTION_ENABLED"
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "overlays-fs"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "maestro-intelligence"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_iam_member.github-sa["roles/artifactregistry.createOnPushWriter"] will be created
  + resource "google_project_iam_member" "github-sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-maestro-terraform@maestro-intelligence.iam.gserviceaccount.com"
      + project = "maestro-intelligence"
      + role    = "roles/artifactregistry.createOnPushWriter"
    }

  # google_project_iam_member.github-sa["roles/dataflow.admin"] will be created
  + resource "google_project_iam_member" "github-sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-maestro-terraform@maestro-intelligence.iam.gserviceaccount.com"
      + project = "maestro-intelligence"
      + role    = "roles/dataflow.admin"
    }

  # google_project_iam_member.github-sa["roles/datastore.owner"] will be created
  + resource "google_project_iam_member" "github-sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-maestro-terraform@maestro-intelligence.iam.gserviceaccount.com"
      + project = "maestro-intelligence"
      + role    = "roles/datastore.owner"
    }

  # google_project_iam_member.github-sa["roles/editor"] will be created
  + resource "google_project_iam_member" "github-sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-maestro-terraform@maestro-intelligence.iam.gserviceaccount.com"
      + project = "maestro-intelligence"
      + role    = "roles/editor"
    }

  # google_project_iam_member.github-sa["roles/firebase.admin"] will be created
  + resource "google_project_iam_member" "github-sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-maestro-terraform@maestro-intelligence.iam.gserviceaccount.com"
      + project = "maestro-intelligence"
      + role    = "roles/firebase.admin"
    }

  # google_project_iam_member.github-sa["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "github-sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-maestro-terraform@maestro-intelligence.iam.gserviceaccount.com"
      + project = "maestro-intelligence"
      + role    = "roles/storage.admin"
    }

  # google_project_service.project_services["bigquery.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "maestro-intelligence"
      + service                    = "bigquery.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "10m"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12180227314`](https://github.com/lessthan3/personalization/actions/runs/12180227314) - commit 004d7f4dd1bf668f1b602a31f4d2fea13d230608
